/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   buffer.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: amalsago <amalsago@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/15 04:48:44 by amalsago          #+#    #+#             */
/*   Updated: 2019/03/02 14:41:44 by amalsago         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

void		print_buffer(t_buffer *buffer)
{
	write(1, buffer->content, buffer->index); // Вывести на экран строку в количестве индекса
	buffer->length += buffer->index; // Заполнить счётчик количества символов
	buffer->index = 0; // Передвинуть индекс на 0
}
