/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parsing.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: amalsago <amalsago@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/26 09:25:40 by amalsago          #+#    #+#             */
/*   Updated: 2019/03/04 19:13:02 by amalsago         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

void				parsing(const char **format, t_info *info)
{
	initialize_specifiers(info->specs);
	info->type = 0;
	while (**format && !(info->type)) // Пока читаю символы И пока не устоновлен тип плейсхолдера
	{
		if (ft_isprint(**format)) // Является текущий символ символом между ' ' и '~'
			jump_table[**format - ' '](format, info); // Если да, то определить и вызвать отосящююся функцию передав строку и структуру плейсхолдера
	}
	print_info(info);
}
